# gold5 - 2225. 합분해

import sys

input = sys.stdin.readline

# 0부터 N까지의 정수 K개를 더해서 그 합이 N이 되는 경우의 수

# k가 1개면 무조건 1

# 2개, 합이 20
# 0 20
# 1 19
# ...
# 20 0
# -> 21개 -> n+1

# 3개, 합이 3 -> 10
# 0 _ _ -> 4개 (3+1)
# 1 _ _ -> 3개 (2+1)
# 2 _ _ -> 2개 (1+1)
# 3 _ _ -> 1개 (0+1)

# 3개, 합이 4 (k=3, n=4) -> 15
# 0 _ _ -> 5개 (4+1)
# 1 _ _ -> 4개 (3+1)
# 2 _ _ -> 3개 (2+1)
# 3 _ _ -> 2개 (1+1)
# 4 _ _ -> 1개 (0+1)
# -> (k=2, n=4) + (k=2, n=3) + .. + (k=2, n=0)
# -> (k=2, n=4) + (k=3, n=3)

n, k = map(int, input().split())
dp = [[0] * (n + 2) for _ in range(k + 2)]

# dp[k][n]
dp[1] = [1] * (n + 1)
dp[2] = [i + 1 for i in range(n + 1)]

for i in range(3, k + 1):
    dp[i][1] = i  # n이 1이면 k만큼 나옴 (k=3 -> 001 010 100)
    for j in range(2, n + 1):
        dp[i][j] = dp[i - 1][j] + dp[i][j - 1]

print(dp[k][n] % 1_000_000_000)
